In [11]:
import pandas as pd
from sqlalchemy import create_engine

In [29]:
import pymysql
pymysql.install_as_MySQLdb()

In [12]:
premise_file = "Resources/yob1950.csv"
name_1950_df = pd.read_csv(premise_file, header=None)
name_1950_df.head()

          0  1      2
0     Linda  F  80432
1      Mary  F  65482
2  Patricia  F  47945
3   Barbara  F  41557
4     Susan  F  38018

In [13]:
name_1950_df = name_1950_df.rename(index=str, columns={0:"first_name", 1:"sex", 2:"number_of_names"})
name_1950_df.head()

  first_name sex  number_of_names
0      Linda   F            80432
1       Mary   F            65482
2   Patricia   F            47945
3    Barbara   F            41557
4      Susan   F            38018

In [14]:
name_1950_df = name_1950_df.loc[name_1950_df['sex']=='M']
name_1950_df.head()

     first_name sex  number_of_names
6111      James   M            86239
6112     Robert   M            83565
6113       John   M            79420
6114    Michael   M            65151
6115      David   M            60730

In [15]:
name_1950_df = name_1950_df.drop(columns = ["sex"])
name_1950_df.head()

     first_name  number_of_names
6111      James            86239
6112     Robert            83565
6113       John            79420
6114    Michael            65151
6115      David            60730

In [16]:
name_1950_df["year"] = "1950"

In [17]:
name_1950_df.head()

     first_name  number_of_names  year
6111      James            86239  1950
6112     Robert            83565  1950
6113       John            79420  1950
6114    Michael            65151  1950
6115      David            60730  1950

In [18]:
premise_file = "Resources/yob2000.csv"
name_1990_df = pd.read_csv(premise_file, header=None)
name_1990_df = name_1990_df.rename(index=str, columns={0:"first_name", 1:"sex", 2:"number_of_names"})
name_1990_df = name_1990_df.loc[name_1990_df['sex']=='M']
name_1990_df = name_1990_df.drop(columns = ["sex"])
name_1990_df["year"] = "1990"
name_1990_df.head()

        first_name  number_of_names  year
17653        Jacob            34471  1990
17654      Michael            32035  1990
17655      Matthew            28572  1990
17656       Joshua            27538  1990
17657  Christopher            24931  1990

In [20]:
combined_df = name_1950_df
combined_df = combined_df.append(name_1990_df)

In [59]:
combined_df = combined_df.set_index('first_name')

In [24]:
premise_file = "Resources/nba.csv"
nba = pd.read_csv(premise_file)
nba.head()

  first_name  birth_year           new
0   DeMarcus        1990  1990DeMarcus
1     Travis        1950    1950Travis
2   JaMychal        1990  1990JaMychal
3        Bud        1950       1950Bud
4    Carrick        1990   1990Carrick

In [25]:
nba = nba.drop(columns = "new")

In [42]:
nba.head()

  first_name  birth_year
0   DeMarcus        1990
1     Travis        1950
2   JaMychal        1990
3        Bud        1950
4    Carrick        1990

In [43]:
nba.set_index("first_name", inplace=True)

In [47]:
nba.head()

            birth_year
first_name
DeMarcus          1990
Travis            1950
JaMychal          1990
Bud               1950
Carrick           1990

In [51]:
connection_string = "root:IworkatCTX123!@localhost/nba_db"
engine = create_engine(f'mysql://{connection_string}')

In [56]:
engine.table_names()

['names', 'nba']

In [60]:
combined_df.head()

            number_of_names  year
first_name
James                 86239  1950
Robert                83565  1950
John                  79420  1950
Michael               65151  1950
David                 60730  1950

In [61]:
combined_df.to_sql(name='names', con=engine, if_exists='append', index=True)

In [53]:
nba.to_sql(name='nba', con=engine, if_exists='append', index=True)